/*
- ==たこ
. ==わさ
*/

let json = {
  "0": "たこたこたこたこたこ ",
  "1": "わさたこたこたこたこ ",
  "2": "わさわさたこたこたこ ",
  "3": "わさわさわさたこたこ ",
  "4": "わさわさわさわさたこ ",
  "5": "わさわさわさわさわさ ",
  "6": "たこわさわさわさわさ ",
  "7": "たこたこわさわさわさ ",
  "8": "たこたこたこわさわさ ",
  "9": "たこたこたこたこわさ ",
  "a": "わさたこ ",
  "b": "たこわさわさわさ ",
  "c": "たこわさたこわさ ",
  "d": "たこわさわさ ",
  "e": "わさ ",
  "f": "わさわさたこわさ ",
  "g": "たこたこわさ ",
  "h": "わさわさわさわさ ",
  "i": "わさわさ ",
  "j": "わさたこたこたこ ",
  "k": "たこわさたこ ",
  "l": "わさたこわさわさ ",
  "m": "たこたこ ",
  "n": "たこわさ ",
  "o": "たこたこ- ",
  "p": "わさたこたこわさ ",
  "q": "たこたこわさたこ ",
  "r": "わさたこわさ ",
  "s": "わさわさわさ ",
  "t": "たこ ",
  "u": "わさわさたこ ",
  "v": "わさわさわさたこ ",
  "w": "わさたこたこ ",
  "x": "たこわさわさたこ ",
  "y": "たこわさたこたこ ",
  "z": "たこたこわさわさ ",
  ".": "たこわさたこわさたこ ",
  ",": "たこたこわさわさたこたこ ",
  "?": "わさわさたこたこわさたこ ",
  "!": "たこわさたこわさたこたこ ",
  "-": "たこわさわさわさわさたこ ",
  "/": "たこわさわさたこわさ ",
  "@": "わさたこたこわさたこわさ ",
  "(": "たこわさたこたこわさ ",
  ")": "たこわさたこたこわさたこ ",
  "": " ",};

// モールス信号 → 英語
function decode(e) {
  out = ""; //変数outリセット
  
  //半角スペースで区切って配列化
  //カッコの中は最後に半角スペースが入ってない時のために最後に半角スペースを追加
  e = (e + " ").split(" ");
  
  //1つずつ英文に置き換えて変数outに加える
  for (let i = 0; i < e.length; i++) {
    let result = Object.keys(json).filter(
      function (k) {
        return json[k] == e[i] + " "
      }
    )[0];
    out = out + result;
  }
  
  //エラー処理
  if (out.includes("undefined")){
    out = "error：正しい信号を入力してください";
  }
  var untacowasalang = document.getElementById("untacowasa_lang");
  untacowasalang.innerHTML =out;
}
