/*
- ==たこ
. ==わさ
*/
let json = {
  "0": "たこたこたこたこたこ ",
  "1": "わさたこたこたこたこ ",
  "2": "わさわさたこたこたこ ",
  "3": "わさわさわさたこたこ ",
  "4": "わさわさわさわさたこ ",
  "5": "わさわさわさわさわさ ",
  "6": "たこわさわさわさわさ ",
  "7": "たこたこわさわさわさ ",
  "8": "たこたこたこわさわさ ",
  "9": "たこたこたこたこわさ ",
  "a": "わさたこ ",
  "b": "たこわさわさわさ ",
  "c": "たこわさたこわさ ",
  "d": "たこわさわさ ",
  "e": "わさ ",
  "f": "わさわさたこわさ ",
  "g": "たこたこわさ ",
  "h": "わさわさわさわさ ",
  "i": "わさわさ ",
  "j": "わさたこたこたこ ",
  "k": "たこわさたこ ",
  "l": "わさたこわさわさ ",
  "m": "たこたこ ",
  "n": "たこわさ ",
  "o": "たこたこ- ",
  "p": "わさたこたこわさ ",
  "q": "たこたこわさたこ ",
  "r": "わさたこわさ ",
  "s": "わさわさわさ ",
  "t": "たこ ",
  "u": "わさわさたこ ",
  "v": "わさわさわさたこ ",
  "w": "わさたこたこ ",
  "x": "たこわさわさたこ ",
  "y": "たこわさたこたこ ",
  "z": "たこたこわさわさ ",
  ".": "たこわさたこわさたこ ",
  ",": "たこたこわさわさたこたこ ",
  "?": "わさわさたこたこわさたこ ",
  "!": "たこわさたこわさたこたこ ",
  "-": "たこわさわさわさわさたこ ",
  "/": "たこわさわさたこわさ ",
  "@": "わさたこたこわさたこわさ ",
  "(": "たこわさたこたこわさ ",
  ")": "たこわさたこたこわさたこ ",
  "": " ",};
  /*
- ==たこ
. ==わさ
*/
function encode(e) {
  out = ""; //変数outリセット

  //大文字,改行を消して一文字ずつ区切って配列化
  e = e.toLowerCase().replace(/[\n\r]/g,"").split("");
  //>"Hello." → ["h","e","l","l","o","."]
  
  //一文字ずつモールス信号へ置き換えて、変数outに加える
  //json[e[i]]は文字が"h"の場合はjson.hのように動作する
  for (let i = 0; i < e.length; i++) {
    out = out + json[e[i]];
  }
  e="";
  var tacowasalang = document.getElementById("tacowasa_lang");
  tacowasalang.innerHTML =out;
}

function copyToClipBoard() {
  var tacowasalang = document.getElementById("tacowasa_lang");
  tacowasalang.select();
  document.execCommand('copy');

  alert("グリップボードにコピーしました！");
}